cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'codeclimate/formulae'

brew 'ag'
brew 'ruby-install'
brew 'chruby'
brew 'nvm'

brew 'python'

brew 'graphviz'

brew 'heroku-toolbelt'

brew 'libgit2'

# Java
cask 'java'

# OS X Preview plugins
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'

# VM management
cask 'dockertoolbox'
cask 'virtualbox'
cask 'otto'
cask 'consul'

cask 'gpgtools'

# Code
brew 'codeclimate'

# Database
cask 'postgres'

# GUI
cask 'shiftit'
cask 'gitup'
cask 'sourcetree'
cask 'textmate'
cask 'sublime-text3'
cask 'cyberduck'

# Communication
cask 'screenhero'
cask 'slack'
cask 'skype'

# Books
cask 'calibre'
brew 'pandoc'