cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'codeclimate/formulae'

brew 'git'
brew 'ag'
brew 'ripgrep'
brew 'libyaml'
brew 'gmp'
brew 'ruby-install'
brew 'chruby'
brew 'yarn'
brew 'nvm'

brew 'python'

brew 'graphviz'

brew 'heroku-toolbelt'

brew 'libgit2'

# Java
cask 'java'

# OS X Preview plugins
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'

# VM management
cask 'docker'
cask 'virtualbox'

# Security
cask 'cloak'
cask 'gpgtools'

# Code
cask 'dash'
brew 'codeclimate'
brew 'geckodriver'
cask 'visual-studio-code'

# Database
cask 'postgres'

# GUI
cask 'alfred'
cask 'shiftit'
cask 'gitkraken'
cask 'rowanj-gitx'
cask 'textmate'
cask 'sublime-text'
cask 'cyberduck'
cask 'licecap'
cask 'iina'

# Communication
cask 'screenhero'
cask 'slack'
cask 'skype'

# Books
cask 'calibre'
brew 'pandoc'
