cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'codeclimate/formulae'

brew 'automake'

brew 'bash'
brew 'zsh'
brew 'git'
brew 'ag'
brew 'ripgrep'
brew 'libyaml'
brew 'libffi'
brew 'gmp'
brew 'gdbm'
brew 'ruby-install'
brew 'chruby'
brew 'yarn'
brew 'asdf'
brew 'exa'
brew 'openssl@1.1'
brew 'readline'
brew 'redis'

brew 'python'

brew 'graphviz'

tap 'heroku/brew'

brew 'libgit2'

# OS X Preview plugins
cask 'quicklook-json'
cask 'quicklook-csv'

# VM management
# cask 'virtualbox'

# Security
cask 'encryptme'
cask 'gpg-suite'

# Code
cask 'dash'
# brew 'codeclimate'
brew 'geckodriver'
cask 'visual-studio-code'

# Database
# cask 'postgres'

# GUI
cask 'alfred'
cask 'hammerspoon'
cask 'textmate'
cask 'sublime-text'
cask 'cyberduck'
cask 'licecap'
cask 'iina'

# Communication
# cask 'slack'

# Books
cask 'calibre'
brew 'pandoc'
brew 'librsvg'
brew 'python'
cask 'basictex'
